// https://xuexiao.chazidian.com/news60267/

const professional = [{
    id: 1,
    name: '计算机科学技术',
    courseList: [
        '数字逻辑与实验',
        'PASCAL程序设计',
        '离散数学',
        '汇编语言程序设计',
        '计算机原理与设计',
        '数据结构',
        '操作系统',
        '编译方法',
        '数据库系统',
        '计算机网络',
        '计算机导论'
    ]
}, {
    id: 2,
    name: '电子工程',
    courseList: [
        '大学物理',
        '线性代数',
        '数学物理方程',
        '电磁场与波',
        '电路分析基础',
        '信号与系统',
        '模拟电子线路',
        '数字电路',
        '数字信号处理',
        'C语言',
        '计算方法与程序设计'
    ]
}, {
    id: 3,
    name: '数学',
    courseList: [
        '经济学',
        '经济数学',
        '计算机基础',
        '经济法',
        '统计学原理',
        '货币银行学',
        '基础会计学',
        '企业财务会计',
        '管理会计',
        '成本会计',
        '财务管理与分析',
        '审计学',
        '财政学',
        '会计电算化',
        '管理学原理'
    ]
}, {
    id: 4,
    name: '生物技术',
    courseList: [
        '高等数学',
        '无机化学',
        '有机化学',
        '普通物理学',
        '基础生物学',
        '生物化学',
        '微生物学',
        '细胞生物学',
        '遗传学',
        '生化技术学',
        '动物生理学',
        '植物生理学',
        '分子遗传学',
        '仪器分析'
    ]
}]

module.exports = professional;
